Revit 2026 API

# LightDistribution Class

---

This class is the base class for specifying light distribution.

SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingHemisphericalLightDistribution Autodesk.Revit.DB.LightingPhotometricWebLightDistribution Autodesk.Revit.DB.LightingSphericalLightDistribution Autodesk.Revit.DB.LightingSpotLightDistribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightDistribution : IDisposable
```
```vb
Public Class LightDistribution
	Implements IDisposable
```
```cpp
public ref class LightDistribution : IDisposable
```
```fsharp
type LightDistribution =
    class
        interface IDisposable
    end
```

The LightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightDistribution derived object. |
|  | Dispose | Releases all resources used by the LightDistribution |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace